<template>
  <TableComponent
      :head-prop="headProp"
      :body-prop="virtualObj"
      :footer-prop="footerProp"
      :repid="'qweqweasdzxc'"
      :render-table="init"
  />
</template>

<script>
import TableComponent from "../TableComponent";

export default {
  name: "TableComponentTest1",
  // Используемые компоненты
  components: {TableComponent},
  data() {
    return {
      renderVal: false,
      headProp: {},
      virtualObj: {},
      footerProp: {},
    }
  },
  // методы компоненита
  methods: {
    init() {
      this.renderVal = !this.renderVal;
      return this.renderVal
    },
  },
  created() {
    this.headProp = {
      0: 'bool',
      1: 'Зал',
      2: '% от выручки',
      3: 'Показатель',
      4: 'Неделя 36 01.09-06.09.21',
      5: 'Неделя "37 07.09-13.09.21',
      6: 'Неделя 38 14.09-20.09.21',
      7: 'Неделя \'39 21.09-27.09.21',
      8: 'Неделя &quot; 40 28.09-30.09.21',
      9: 'Итого',
      10: 'Тренд',
    },
    this.virtualObj = {
      0: {
        0: 'bool',
        1: 'Зал 11',
        2: '102,3%',
        3: 'Выручка, руб.',
        4: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          },
          1: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          },
          2: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          }
        },
        5: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          },
          1: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          }
        },
        6: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          },
          1: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          }
        },
        7: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          },
          1: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          }
        },
        8: '5 417 000',
        9: '15 665 109',
        10: '+17,4%',
      },
      1: {
        0: 'bool',
        1: 'Зал 10',
        2: '140,8%',
        3: 'Выручка, руб.',
        4: '17 697 135',
        5: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          },
          1: {
            0: '1 037 000',
            1: '1 037 000',
            2: '304 000'
          }
        },
        6: '17 632 525',
        7: '17 734 000',
        8: {
          0: {
            2: '342 000'
          },
          1: {
            2: '304 000'
          }
        },
        9: '70 665 109',
        10: '+116,4%',
      },
      2: {
        0: 'bool',
        1: 'Зал 9',
        2: '22,3%',
        3: 'Выручка, руб.',
        4: '2 397 535',
        5: {
          0: '342 000',
          1: '304 000'
        },
        6: '3 432 525',
        7: {
          0: {
            0: 'fdsgfdg',
            1: '1 034 900',
            2: '342 000'
          }
        },
        8: '3 541 730',
        9: '30 665 109',
        10: '+27,4%',
      },
      3: {
        0: 'bool',
        1: 'Зал 4',
        2: '54,8%',
        3: 'Выручка, руб.',
        4: '9 197 135',
        5: '929 720',
        6: '812 525',
        7: '19 134 000',
        8: '39 581 730',
        9: '119 665 109',
        10: '+65,4%',
      }
    },
    this.footerProp = {
      0: 'null',
      1: 'Итого',
      2: '100%',
      3: 'Выручка, руб.',
      4: '10 632 525',
      5: '11 632 525',
      6: '12 632 525',
      7: '13 632 525',
      8: '14 632 525',
      9: 'абра',
      10: 'кадабра',
    }
  },
  mounted() {
    // this.emitter.emit('change-view');
  },
}
</script>

<style scoped>
</style>
